---
kind: type
id: T:Autodesk.Revit.DB.Structure.AnalyticalStructuralRole
source: html/687bab2b-0ad0-9dd9-f733-8e1a9e5fd44f.htm
---
# Autodesk.Revit.DB.Structure.AnalyticalStructuralRole

Indicates the structural role for the analytical elements.

## Syntax (C#)
```csharp
public enum AnalyticalStructuralRole
```